{"blog_content": "This is sample draft, to show how the blog is to be written. Here I will show how to add images and how to represent text that is to be shown as bold.<br /><br />These two are two separate paragraphs and are to be separated by a single blank line like above, you see the parser will convert this blank line into '<br /><br />'. and when the web page is rendered it will be shown as two separate paragraphs.<br /><br /><div class='row'><div class='col' style='text-align: center;'><figure class='figure' style='align-items: center;'><img src='static/images/some_random_name.webp' alt='This is the alt attribute of an image, this is shown when the browser is not able to fetch an image.' onclick='magnify(this.src)' class='figure-img img-fluid blog-image'><figcaption class='figure-caption blog-fig-caption'>This is what will be shown underneath the image:end_img</figcaption></figure></div></div><br /><br />From the above tag, all the necessary information such as image source, image alt text, image caption will be extracted and will be inserted into a pre defined format, which will render the image as intended in the webpage. Notice how there are blank lines between the above image tag and the paragraph, this is partly done to ensure, that the web page when rendered looks good and not cluttered. As a practice, ensure that you add a blank line after and before an image.<br /><br />The above paragraph shows how you can add an image, now, we will use bold text. this is done by wrapping any word phrase that you want to show bold within \\*\\*. Like <strong>this</strong>, see the processed file <strong>sample_parsed_content.json</strong> to see more, you will notice that the phrases enclosed within \\*\\* are now enclosed within 'strong' tag of HTML.  They will look bold once the content has rendered onto the page. <br /><br />This pretty much sums up the basics, keep in mind that if you want to put something in quotations, use 'single quotes' as double quotes will give an erroneous JSON file, but same single quotes won't give an erroneous HTML when rendered.<br /><br />You can copy the string in 'blog_contents', paste it into an html file and see the results for yourself."}