{"blog_content": "How does the computer see an image?<br /><br />What is the specification of your mobile camera?32MP? 1080P? 4k?Ever wondered what this means?Let’s dive in, starting from the basics.<br /><br />In computer language, an image is nothing more than a huge(HUGE) collection of numbers. The image is broken down into n number of boxes (the greater the number, the better), then we define the color for each of these boxes. Define the color how? Using the RGB color space constructs all the colors from the combination of the Red, Green, and Blue components of that particular element.For example, look at the cat below and look at how a very zoomed-in version of her forehead spot looks.<br /><br /><div class='row'><div class='col' style='text-align: center;'><figure class='figure' style='align-items: center;'><img src='/static/images/DataScience/image/Dithering_example_undithered.webp' alt='Example of a pixelated image' onclick='magnify(this.src)' class='figure-img img-fluid blog-image'><figcaption class='figure-caption blog-fig-caption'>Example of a pixelated image</figcaption></figure></div></div><br /><br /><br /><br />The quality of a picture depends on how many such squares it consists of, because the higher the number of squares, the more control we have on how and what the image would look like. Technically, each of these tiny squares is called a Pixel.So, when you say your camera is 13MP, it simply means the before taking a picture your camera makes 13 million small boxes, fills and identifies the color and shade for each of these boxes, and finally saves it similarly.<br /><br /><br /><br />Images can be of two types majorly — 2D or 3DWhen we talk about a 2D image, each pixel is classified as black or white and saved that way. The image array in this case would only have 2 Dimensions and thus being called a 2D image.Talking of 3D images, each pixel is stored along with its color in Hex encoding, making a 3 Dimensional array for the image.<br /><br />Stay tuned for more information on Image Processing."}