{"blog_content": "<div class='row'><div class='col' style='text-align: center;'><figure class='figure' style='align-items: center;'><img src='static/images/DataScience/what_is_data_science/what_is_data_science_1.webp' alt='Introduction to Data Science' onclick='magnify(this.src)' class='figure-img img-fluid blog-image'><figcaption class='figure-caption blog-fig-caption'>Introducation to Data Science</figcaption></figure></div></div><br /><br /><br /><br />Data science is a multi-disciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from structured and unstructured data.<br /><br />Says so, the Wikipedia!<br /><br />Simply put, data science is nothing more than the study of data. Right from the beginning we have been taught traditional tools like mean, median and mode as measures of central tendency, what happens when we don’t want to revolve around the center or our data is so enormously large that these measures fail? That is how we started the journey of what today is one of the utmost important branches of science — “Data Science”<br /><br /><br /><br />Data Science can be broadly divided into five major categories:<br /><br /><strong>Data Collection</strong>: Is the art acquiring data from various valid sources that need to studied. Jobs Available: Data Engineer, Database Developer, Statistician<br /><br /><strong>Data Cleaning</strong>: Refers to the process of pre-processing the acquired data to bring it down in a usable form in order to make it simpler to read and draw conclusions from. Jobs Available: Planning Analyst, Decisions Analyst, Communications Analyst<br /><br /><strong>Data Analysis</strong>: Studying the thus formed organised slot of data, understanding it and plotting of various different approaches to reach a certain conclusion. Jobs Available: Business Intelligence Engineer, Business Intelligence Developer, Business Intelligence Analyst, Data Strategist<br /><br /><strong>Machine Learning</strong>: Is the use of appropriate algorithms discussed during the analysis. Jobs Available: Machine Learning Engineer, Artificial Intelligence Specialist, Cognitive Developer, Researcher<br /><br /><strong>Data Visualization</strong>: This is the graphic related part of Data Science which mainly deals in the successful representation of outcomes. Jobs Available: Data Viz Engineer, Data Viz Developer, Software Developer<br /><br />All these categories have separate scopes and use in the world today. Stay tuned to read more.If you believe this added a few drops in the pool of your knowledge, like and share!<div class='row'><div class='col'></div><div class='col'></div></div>"}